In [2]:
import numpy as np
import pandas as pd

In [12]:
marketing_data = pd.read_csv('marketing_campaign.csv')
marketing_data[['ID' , 'Year_Birth' , 'Education' , 'Marital_Status' , 'Income' , 'Kidhome' , 'Teenhome' , 'Dt_Customer' , 'Recency' , 'NumStorePurchases' , 'NumWebVisitsMonth']]

#GROUP KIDHOME
kidhome_data = marketing_data.groupby('Kidhome')['NumWebVisitsMonth'].sum()
print(kidhome_data)

print('\n')

### APPENDING 
marketing_append1 = pd.read_csv('marketing_campaign_append1.csv')
marketing_append2 = pd.read_csv('marketing_campaign_append2.csv')
appended_data = pd.concat([marketing_append1 , marketing_append2])
print(appended_data)

### CONCATING
marketing_concat1 = pd.read_csv('marketing_campaign_concat1.csv')
marketing_concat2 = pd.read_csv('marketing_campaign_concat2.csv')
concate_data = pd.concat([marketing_concat1 , marketing_concat2] , axis = 1)
print(concate_data)

### MERGING
marketing_merge1 = pd.read_csv('marketing_campaign_merge1.csv')
marketing_merge2 = pd.read_csv('marketing_campaign_merge2.csv')
pd.merge(marketing_merge1 , marketing_merge2 , on='ID')

Kidhome
0    5629
1    5960
2     320
Name: NumWebVisitsMonth, dtype: int64


        ID  Year_Birth   Education Marital_Status   Income  Kidhome  Teenhome  \
0     5524        1957  Graduation         Single  58138.0        0         0
1     2174        1954  Graduation         Single  46344.0        1         1
2     4141        1965  Graduation       Together  71613.0        0         0
3     6182        1984  Graduation       Together  26646.0        1         0
4     5324        1981         PhD        Married  58293.0        1         0
..     ...         ...         ...            ...      ...      ...       ...
495   7646        1989  Graduation         Single  64449.0        1         0
496   1640        1954  Graduation       Divorced  64587.0        1         1
497   5184        1995  Graduation         Single  34824.0        0         0
498   8492        1978  Graduation       Together  75437.0        0         0
499  11188        1957  Graduation       Together  26091.0        1         1

    Dt_Customer  Recency  MntWines  ...  NumWebVisitsMonth  AcceptedCmp3  \
0    04/09/2012       58       635  ...                  7             0
1    08/03/2014       38        11  ...                  5             0
2    21/08/2013       26       426  ...                  4             0
3    10/02/2014       26        11  ...                  6             0
4    19/01/2014       94       173  ...                  5             0
..          ...      ...       ...  ...                ...           ...
495  18/02/2014       70       218  ...                  4             0
496  22/06/2014       49        66  ...                  3             0
497  26/03/2014       65         4  ...                  6             0
498  09/11/2013       25       795  ...                  6             0
499  25/02/2014       84        15  ...                  5             0

     AcceptedCmp4  AcceptedCmp5  AcceptedCmp1  AcceptedCmp2  Complain  \
0               0             0             0             0         0
1               0             0             0             0         0
2               0             0             0             0         0
3               0             0             0             0         0
4               0             0             0             0         0
..            ...           ...           ...           ...       ...
495             0             0             0             0         0
496             0             0             0             0         0
497             0             0             0             0         0
498             0             0             1             0         0
499             0             0             0             0         0

     Z_CostContact  Z_Revenue  Response
0                3         11         1
1                3         11         0
2                3         11         0
3                3         11         0
4                3         11         0
..             ...        ...       ...
495              3         11         0
496              3         11         0
497              3         11         0
498              3         11         0
499              3         11         0

[1000 rows x 29 columns]
         ID  Year_Birth   Education Marital_Status   Income  \
0      5524        1957  Graduation         Single  58138.0
1      2174        1954  Graduation         Single  46344.0
2      4141        1965  Graduation       Together  71613.0
3      6182        1984  Graduation       Together  26646.0
4      5324        1981         PhD        Married  58293.0
...     ...         ...         ...            ...      ...
2235  10870        1967  Graduation        Married  61223.0
2236   4001        1946         PhD       Together  64014.0
2237   7270        1981  Graduation       Divorced  56981.0
2238   8235        1956      Master       Together  69245.0
2239   9405        1954         PhD        Married  52869.0

      NumDealsPurchases  NumWebPurchases  NumCatalogPurchases  \
0                     3                8                   10
1                     2                1                    1
2                     1                8                    2
3                     2                2                    0
4                     5                5                    3
...                 ...              ...                  ...
2235                  2                9                    3
2236                  7                8                    2
2237                  1                2                    3
2238                  2                6                    5
2239                  3                3                    1

      NumStorePurchases  NumWebVisitsMonth
0                     4                  7
1                     2                  5
2                    10                  4
3                     4                  6
4                     6                  5
...                 ...                ...
2235                  4                  5
2236                  5                  7
2237                 13                  6
2238                 10                  3
2239                  4                  7

[2240 rows x 10 columns]

         ID  Year_Birth   Education Marital_Status   Income
0      5524        1957  Graduation         Single  58138.0
1      2174        1954  Graduation         Single  46344.0
2      4141        1965  Graduation       Together  71613.0
3      6182        1984  Graduation       Together  26646.0
4      5324        1981         PhD        Married  58293.0
...     ...         ...         ...            ...      ...
2235  10870        1967  Graduation        Married  61223.0
2236   4001        1946         PhD       Together  64014.0
2237   7270        1981  Graduation       Divorced  56981.0
2238   8235        1956      Master       Together  69245.0
2239   9405        1954         PhD        Married  52869.0

[2240 rows x 5 columns]